sample.xml

"""<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><SaveAssetDeltas xmlns="http://GettyImages.com/"><SaveAssetDeltasRequest xmlns="http://GettyImages.com/SaveAssetDeltasRequest.xsd"><AssetDeltaSet><MasterIDs xmlns="http://GettyImages.com/AssetDelta.xsd">1234</MasterIDs><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>61837</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>61845</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>61851</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>161039</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>235275</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>97626</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>61868</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>116105</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>7376215</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>61804</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>61813</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>235276</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>158962</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>61841</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>61842</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>83167</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>61847</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>61849</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>61855</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>61859</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>101590</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>101455</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>138437</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>61809</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>61807</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>150719</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>61833</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>61831</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>61934</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>102349</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>61925</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>101885</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>101884</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>61873</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>251770</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>251772</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>61895</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>251771</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>13760281</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>13760280</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>83558</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>61843</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>76406</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>127160</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>249954</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>249955</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>249956</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>106588</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>80636</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>150555</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>80635</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>7984452</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>7984451</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>1324684</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>807748</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>102033</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>3952590</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>9102255</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>78079</ItemID></Deltas><Deltas xmlns="http://GettyImages.com/AssetDelta.xsd"><DeltaType>Delete</DeltaType><FieldType>Keyword</FieldType><ItemID>61862</ItemID></Deltas><VitriaPublishPriority xmlns="http://GettyImages.com/AssetDelta.xsd">string</VitriaPublishPriority><BlockVitriaPublish xmlns="http://GettyImages.com/AssetDelta.xsd">boolean</BlockVitriaPublish></AssetDeltaSet><User>string</User><UserGroupCode>string</UserGroupCode></SaveAssetDeltasRequest></SaveAssetDeltas></soap:Body></soap:Envelope>"""